modules/OpenQBMM/tutorials/mixingTransportFoam/twoStreamsEQMOM/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   nonuniform List<scalar> 
3000
(
4.9100694356e-06
2.32348407402e-06
1.18826490543e-06
6.78607574732e-07
4.39905271564e-07
3.22998989697e-07
2.63105223293e-07
2.3107415877e-07
...
)
;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform 1.944e-07;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 1.944e-07;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
200
(
4.9100694356e-06
6.63463009956e-06
4.85757280378e-06
3.64711962701e-06
2.833475447e-06
2.35603937464e-06
2.06078050136e-06
1.88159640873e-06
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
